rammp-org/prototype-fw/five_bar_v1/sdkconfig.defaults
# TODO: uncomment one of these if you want to support a specifc target by default
# CONFIG_IDF_TARGET="esp32"
# CONFIG_IDF_TARGET="esp32s2"
CONFIG_IDF_TARGET="esp32p4"
# CONFIG_IDF_TARGET="esp32s3"

# The connected ESP32-P4 board is revision v1.3. Revisions below v3.0 use a
# different hardware configuration and must be selected explicitly.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y

# TODO: uncomment if you want freertos to run at 1 khz instead of the default 100 hz
# CONFIG_FREERTOS_HZ=1000

# TODO: uncomment if you want to run the esp at max clock speed (240 mhz)
# ESP32-specific
#
# CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
# CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

# TODO: uncomment if you want to update the event and main task stask sizes
# Common ESP-related
#
# CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
# CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192